Repository: StephaneH/core-XToolbox
Catalog: JavaScript/Resources/*.lproj/Errors_javascript_*.xlf
Languages: cs

# ERR_jvsc_4000
source: Wrong type for parameter #{p1}, expected File or String.
cs: Špatný typ parametru #{p1}, očekáván soubor nebo string.

# ERR_jvsc_4001
source: Wrong type for parameter #{p1}, expected String.
cs: Špatný typ parametru #{p1}, očekáván string.

# ERR_jvsc_4002
source: Wrong type for parameter #{p1}, expected Boolean.
cs: Špatný typ parametru #{p1}, očekáván boolean.

# ERR_jvsc_4003
source: Wrong type for parameter #{p1}, expected Number.
cs: Špatný typ parametru #{p1}, očekáváno číslo.

# ERR_jvsc_4004
source: Wrong type for parameter #{p1}, expected Folder or String.
cs: Špatný typ parametru #{p1}, očekáván soubor nebo string.

# ERR_jvsc_4005
source: Wrong type for parameter #{p1}, expected DataClass Attribute or String.
cs: Špatný typ parametru #{p1}, očekáván DataClass attribute nebo string.

# ERR_jvsc_4006
source: Wrong type for parameter #{p1}, expected Function.
cs: Špatný typ parametru #{p1}, očekávána funkce.

# ERR_jvsc_4007
source: Wrong type for parameter #{p1}, expected Object.
cs: Špatný typ parametru #{p1}, očekáván objekt.

# ERR_jvsc_4008
source: Wrong type for parameter #{p1}, expected Buffer.
cs: Špatný typ parametru #{p1}, očekáván buffer.

# ERR_jvsc_4009
source: Wrong type for parameter #{p1}, expected Array.
cs: Špatný typ parametru #{p1}, očekáván array.

# ERR_jvsc_4010
source: Method or constructor {p1} expects argument(s).
cs: Method or constructor {p1} očekáván argument.

# ERR_jvsc_4011
source: Wrong type for parameter #{p1}.
cs: Špatný typ parametru #{p1}.

# ERR_jvsc_4012
source: Wrong type for parameter #{p1}, expected Entity DataClass or String.
cs: Špatný typ parametru #{p1}, očekáván Entity DataClass nebo string.

# ERR_jvsc_4013
source: File object must refer to an actual file!
cs: Objekt souboru se musí odkazovat na aktuální soubor!

# ERR_jvsc_4014
source: Folder object must refer to an actual folder!
cs: Objekt složky se musí odkazovat na aktuální složku!

# ERR_jvsc_4015
source: Cannot call undefined function object.
cs: Nelze volat nedefinovaný objekt funkce.

# ERR_jvsc_4016
source: Cannot call '{p1}'. The expression is not evaluated as a function object.
cs: Nelze volat '{p1}'. Výraz nebyl vyhodnocen jako objekt funkce.

# ERR_jvsc_4020
source: Syntax error "{p1}"!
cs: Chyba syntaxe "{p1}"!

# ERR_jvsc_4021
source: Script "{p1}" not found!
cs: Skript "{p1}" nenalezen!

# ERR_jvsc_4022
source: Trying to do a structured clone of an unsupported data type (DataCloneError)!
cs: Pokus o vytvoření klonu struktury nepodporovaného typu dat (DataCloneError)!

# ERR_jvsc_4023
source: Evaluation of require() function implementation ({p1}) failed!
cs: Vyhodnocení implemetace požadované funkce ({p1}) selhalo!

# ERR_jvsc_4024
source: SharedWorker ({p1}) cannot be created recursively!
cs: SharedWorker ({p1}) nemůže být vytvořen rekurzivně!

# ERR_jvsc_4025
source: Trying to reference a neutralized object!
cs: Pokus o odkaz na znepřístupněný objekt!

# ERR_jvsc_4026
source: Parameter #{p1} is not a valid property for the attribute {p2}.
cs: Parametr #{p1} není platná vlastnost pro atribut {p2}.

# ERR_jvsc_4050
source: Invalid object state: Method {p1} cannot be called in current state.
cs: Neplatný stav objektu: Metoda {p1} nemůže být volána v tomto stavu.

# ERR_jvsc_4051
source: Method {p1} is not supported or implemented.
cs: Metoda {p1} není podporována nebo implementována.

# ERR_jvsc_4052
source: Function {p1} does not support all or part of argument {p2}.
cs: Funkce {p1} nepodporuje všechny ne část argumentů {p2}.

# ERR_jvsc_4053
source: Number given as argument {p1} has invalid value (check range).
cs: Číslo předané jako argument {p1} má nepltnou hodnotu (zkontrolujte rozsah).

# ERR_jvsc_4054
source: {p1} operation is forbidden.
cs: {p1} operace je zakázána.

# ERR_jvsc_4055
source: {p1}, line #{p2}, {p3}.
cs: {p1}, řádka #{p2}, {p3}.

# ERR_jvsc_4100
source: Buffer encoding failed!
cs: Kódování bufferu selhalo!

# ERR_jvsc_4101
source: Out of bound of Buffer object!
cs: Za hranicemi objektu bufferu!

# ERR_jvsc_4102
source: Unsupported or unknown encoding {p1}!
cs: Nepodporované nebo neznámé kódování {p1}!

# ERR_jvsc_4120
source: ArrayBuffer has been neutered.
cs: ArrayBuffer byl vyřazen.

# ERR_jvsc_4121
source: Out of bound of TypedArray object!
cs: Za hranicemi objektu TypedArray!

# ERR_jvsc_4122
source: Trying to fill a TypedArray with a bigger Array or TypedArray!
cs: Pokus naplnit TypedArray větším Array nebo TypedArray!

# ERR_jvsc_4200
source: Socket is already connected!
cs: Socket je již připojen!

# ERR_jvsc_4201
source: Expecting SSL key and certificate (options.key and options.cert)!
cs: Očekáván SSL klíč a certifikát (options.key a options.cert)!

# ERR_jvsc_4300
source: Argument {p1} has invalid file system type (must be TEMPORARY ou PERSISTENT)!
cs: Argument {p1} má neplatný typ systému souborů (musí být TEMPORARY nebo PERSISTENT)!

# ERR_jvsc_4301
source: Wrong type for parameter #{p1}, expected DirectoryEntry object.
cs: Špatný typ parametru #{p1}, očekáván objekt DirectoryEntry.

# ERR_jvsc_4302
source: Wrong type for parameter #{p1}, expected DirectoryEntrySync object.
cs: Špatný typ parametru #{p1}, očekáván objekt DirectoryEntrySync.

# ERR_jvsc_4303
source: New name #{p1} must not be an empty string!
cs: Nový název #{p1} nesmí být prázdný string!

# ERR_jvsc_4400
source: BinaryStream does not support net.Socket objects! Use net.SocketSync instead.
cs: BinaryStream nepodporujet net.Socket objekt! Užijte místo toho net.SocketSync.

# ERR_jvsc_4500
source: Unable to retrieve source URL for module loading.
cs: Nelze načíst URL zdroj pro zavedení modulu.

# ERR_jvsc_4501
source: SSJS module system internal error!
cs: SSJS module vnitřní chyba systému!

# ERR_jvsc_4600
source: Invalid system worker name: '{p1}'.
cs: Neplatný název system worker: '{p1}'.

# ERR_jvsc_4601
source: Failed to load the system workers definition file '{path}'.
cs: Selhalo načtení souboru '{path}' definic system workers.

# ERR_jvsc_4602
source: System worker '{p1}' not found.
cs: System worker '{p1}' nenalezen.

# ERR_jvsc_5121
source: The argument is missing.
cs: Chybí argument.

# ERR_jvsc_5122
source: File path is invalid.
cs: Cesta k souboru je neplatná.

# ERR_jvsc_5123
source: File does not exist.
cs: Soubor neexistuje.

# ERR_jvsc_5124
source: Current solution is missing.
cs: Chybí platné řešení.

# ERR_jvsc_5125
source: Wrong argument number.
cs: Chybné číslo argumentu.

# ERR_jvsc_5126
source: Argument mismatch error.
cs: Nevhodný argument.

# ERR_XHRQ_1000
source: Invalid URL method
cs: Neplatná metoda URL

# ERR_XHRQ_1001
source: Dangerous URL method
cs: Nebozúečná metoda URL

# ERR_XHRQ_1002
source: Unsupported URL protocol
cs: Nepodporovaný protokol URL

# ERR_XHRQ_1003
source: Invalid state for requested operation
cs: Neplatný stav pro požadovanou operaci

# ERR_XHRQ_1004
source: Internal JavaScript binding error
cs: Vnitřní chyba JavaScript binding

# ERR_XHRQ_1005
source: Send could not complete
cs: Send nemůže být zkompletován

# ERR_XHRQ_1008
source: Internal implementation error
cs: Vnitřní chyba implementace

# ERR_XHRQ_1009
source: Unsupported parameter for requested operation
cs: Nepodporovaný parametr pro požadovanou operaci

# ERR_CWRP_1101
source: Unsupported protocol
cs: Nepodporovaný protokol

# ERR_CWRP_1105
source: Could not resolve proxy
cs: Nelze rozhodnout proxy

# ERR_CWRP_1106
source: Could not resolve hostname
cs: Nelze rozřešit hostname

# ERR_CWRP_1107
source: Could not connect
cs: Nelze se spojit

# ERR_CWRP_1199
source: Undefined implementation error
cs: Nedefinovaná chyba implementace
