Repository: StephaneH/core-XToolbox
Catalog: ServerNet/Resources/*.lproj/ServerNetCS.xlf
Languages: cs

# ERR_srvr_1
source: Read failed
cs: Čtení selhalo

# SNET_UNKNOWN_ERROR
source: Unknown error code
cs: Neznámý kód chyby

# ERR_srvr_2
source: Write failed
cs: Zápis selhal

# ERR_srvr_3
source: Connection is broken
cs: Spojení se přerušilo

# ERR_srvr_4
source: Connection failed
cs: Spojení selhalo

# ERR_srvr_6
source: End-point is already reading
cs: Koncový bod byl již přečten

# ERR_srvr_7
source: End-point is not reading
cs: koncový bod nebyl přečten

# ERR_srvr_9
source: Invalid parameter
cs: Neplatný parametr

# ERR_srvr_10
source: Invalid internal state
cs: Neplatný vnitřní stav

# ERR_srvr_12
source: Failed to start listener
cs: Start přijímače selhal

# ERR_srvr_14
source: Session not found
cs: Session nebyla nalezena

# ERR_srvr_15
source: Postponed session expired
cs: Odložená session vypršela

# ERR_srvr_16
source: NULL end-point
cs: Koncový bod je NULL

# ERR_srvr_17
source: Read failed (timeout error)
cs: Selhalo čtení (timeout chyba)

# ERR_srvr_18
source: Write failed (timeout error)
cs: Selhal zápis (timeout chyba)

# ERR_srvr_19
source: Keep-alive failed
cs: Udržování spojení selhalo

# ERR_srvr_20
source: SSL certificate not found
cs: SSL certifikát nebyl nalezen

# ERR_srvr_5
source: Network resource temporarily unavailable
cs: Síťový zdroj dočasně nedostupný

# ERR_srvr_8
source: Too much sockets to watch
cs: Příliš mnoho socketů k sledování

# ERR_srvr_11
source: Encryption failed
cs: Selhalo kódování

# ERR_srvr_21
source: Can't subscribe to multicast
cs: Nelze schválit pro multicast

# ERR_srvr_22
source: Socket already watched
cs: Socket již sledován

# ERR_srvr_23
source: Socket stream is over
cs: Socket sledování je ukončeno

# ERR_srvr_30
source: Failed to create a connected socket
cs: Selhalo vytváření připojovaného socketu

# ERR_srvr_31
source: Failed to create a listening socket
cs: Selhalo vytváření sledovaného socketu

# ERR_srvr_40
source: Failed to init SSL framework
cs: Selhala iicializace SSL rámce

# ERR_srvr_41
source: Failed to create a new SSL context
cs: Selhalo vytvoření nového SSL kontextu

# ERR_srvr_42
source: SSL read failed
cs: Selhalo SSL čtení

# ERR_srvr_43
source: SSL write failed
cs: Selhal SSL zápis

# ERR_srvr_44
source: SSL shutdown failed
cs: Ukončení SSL selhalo

# ERR_srvr_45
source: Failed to get SSL certificate
cs: Selhalo získání SSL certifikátu

# ERR_srvr_46
source: Failed to set SSL certificate
cs: Selhalo nastavení SSL certifikátu

# ERR_srvr_47
source: Failed to get SSL private key
cs: Selhalo získání SSL privátního klíče

# ERR_srvr_48
source: Failed to set SSL private key
cs: Selhalo nastavení SSL privátního klíče

# ERR_srvr_49
source: SSL internal error : {p1}
cs: SSL vnitřní chyba : {p1}

# ERR_srvr_51
source: Socket connection broken
cs: Socket spojení přerušeno

# ERR_srvr_52
source: Resource unavailable
cs: Nedostupný zdroj

# ERR_srvr_53
source: Socket read failed
cs: Selhalo socket čtení

# ERR_srvr_54
source: Socket write failed
cs: Selhal socket zápis

# ERR_srvr_55
source: Unexpected socket family
cs: Neočekávaný druh socket

# ERR_srvr_56
source: Failed to secure connection with SSL
cs: Selhalo bezpečné spojení pomocí SSL

# ERR_srvr_57
source: Could not set certificate and/or private key
cs: Nelze nastavit certifikát nebo provátní klíč

# ERR_srvr_58
source: Socket shut down by peer
cs: Ukončení socketu protistranou

# ERR_srvr_101
source: Failed to acquire lock
cs: Selhalo získání zámku(lock)

# ERR_srvr_102
source: Localizer not available
cs: Lokalizer není dostupný

# ERR_srvr_103
source: Localization failed
cs: Lokalizace selhala

# ERR_srvr_301
source: Bonjour name is too long
cs: Bonjour název je příliš dlouhý

# ERR_srvr_302
source: Do not fit in Bonjour packet
cs: Nezpůsobilý jako Bonjour paket

# ERR_srvr_303
source: Malformed Bonjour packet
cs: Zdeformovaný Bonjour paket

# ERR_srvr_304
source: Invalid Bonjour attribute
cs: Neplatný Bonjour atribut

# ERR_srvr_305
source: Bonjour text should be ASCII
cs: Bonjour text musí být ASCII

# ERR_srvr_306
source: Bonjour network failure
cs: Bonjour síť selhala

# ERR_srvr_307
source: Bonjour record already exists
cs: Bonjour záznam již existuje

# ERR_srvr_308
source: Bonjour record not found
cs: Bonjour záznam nenalezen

# ERR_srvr_309
source: Bonjour server is not running
cs: Bonjour server není spuštěn

# ERR_srvr_401
source: Need more bytes to get complete frame header.
cs: K zkomletování frame header je nutno více bytů.

# ERR_srvr_402
source: Frame header is incorrect.
cs: Frame header je chybný.

# ERR_srvr_403
source: Need more bytes to get frame payload.
cs: K získání frame payload je nutno více bytů.

# ERR_srvr_404
source: Invalid state for reading WebSocket.
cs: Neplatný stav pro čtení WebSocketu.

# ERR_srvr_405
source: Invalid state for writing WebSocket.
cs: Neplatný stav pro zapsání WebSocketu.

# ERR_srvr_406
source: Invalid state for closing WebSocket.
cs: Neplatný stav pro zapsání WebSocketu.

# ERR_srvr_407
source: WebSocket operation valid only in OPEN state.
cs: WebSocket operace platná puze ve stavu OPEN.

# ERR_srvr_408
source: WebSocket message already started.
cs: WebSocket zpráva již nastartována.

# ERR_srvr_409
source: WebSocket message not started.
cs: WebSocket zpráva nenastartována.

# ERR_srvr_410
source: WebSocket protocol error.
cs: WebSocket chyba protokolu.

# ERR_srvr_411
source: WebSocket opening handshake needs more bytes.
cs: WebSocket otevírání handshake potřebuje více bytů.

# ERR_srvr_412
source: Connection to WebSocket server failed (not a 101 response).
cs: Připojení k WebSocket serveru selhalo (není odpověď 101).

# ERR_srvr_413
source: Invalid server response (does not comply with WebSocket specification).
cs: Neplatná odpověď serveru (neshoduje se se specifikací WebSocket).

# ERR_srvr_414
source: Wrong WebSocket acceptance key.
cs: Śpatný klíč přijetí WebSocket.

# ERR_srvr_415
source: Invalid WebSocket client request (start of opening handshake).
cs: Neplatný požadavek WebSocket klienta (počátek otevírání handshake).

# SQL_ERROR_FAILED_TO_START_SERVER
source: Failed to launch SQL Server. Please make sure that the port assigned to the SQL Server is not used by another application. If SSL is enabled, make sure the certificate (key.pem and cert.pem) exists at the appropriate location.
cs: Selhalo spuštění SQL Serveru. Ujisěte se prosím, že port přiřazený SQL Serveru není užíván jinou aplikací. Je-li umožněno SSL ujistěte se, že certifikát (key.pem and cert.pem) se nalézá v patřičném místě.

# SQL_ERROR_FAILED_TO_LOCATE_SSL_CERTIFICATE
source: Failed to launch SQL Server: the SSL certificate files (key.pem/cert.pem) cannot be found.
cs: Selhalo spuštění SQL Serveru: SSL soubory certifikátu (key.pem/cert.pem) nelze nalézt.
