Repository: StephaneH/core-XToolbox
Catalog: Kernel/Resources/*.lproj/Errors_xbox_*.xlf
Languages: cs

# ERR_xbox_100
source: Memory allocation failed
cs: Selhalo přidělování paměti

# ERR_xbox_107
source: String allocation failed
cs: Přidělení řetězce string selhalo

# ERR_xbox_200
source: Attempt to read beyond end of stream
cs: Pokus číst za koncem toku dat

# ERR_xbox_208
source: No text converter to read the stream
cs: Žádný textový konvertor ke čtení streamu

# ERR_xbox_300
source: Text conversion failed
cs: Selhala konverze textu

# ERR_xbox_303
source: Failed to initialize ICU library
cs: Selhala iniciace knihovny ICU (InternationalComponentsforUnicode)

# ERR_xbox_304
source: Regex error {message} while parsing pattern "{pattern}"
cs: Chyba regex {message} při syntaktické analýze "{pattern} v ICU"

# ERR_xbox_550
source: JSON malformed in {source}line {line}, position {position}.
cs: Deformovaný JSON v {source} řádek {line}, pozice {position}.

# ERR_xbox_551
source: JSON malformed. Found '{found}', was expecting: {expected}.
cs: Deformovaný JSON. Nalezeno '{found}', očekáváno: {expected}.

# ERR_xbox_552
source: JSON malformed. Unterminated {token}.
cs: Deformovaný JSON. Neukončeno {token}.

# ERR_xbox_553
source: JSON malformed. Extra comma before {token}.
cs: Deformovaný JSON. Samotná čárka před {token}.

# ERR_xbox_554
source: JSON malformed. Was expecting: {expected}.
cs: Deformovaný JSON. Očekáváno: {expected}.

# ERR_xbox_600
source: File "{name}" not found ({path})
cs: Soubor "{name}" nenalezen ({path})

# ERR_xbox_601
source: Cannot rename file "{name}" to "{newname}" ({path})
cs: Soubor s názvem "{name}" nelze přezvat na "{newname}" ({path})

# ERR_xbox_602
source: Cannot open file "{name}" ({path})
cs: Nelze otevřít soubor "{name}" ({path})

# ERR_xbox_603
source: Cannot close file "{name}" ({path})
cs: Nelze uzavřít soubor "{name}" ({path})

# ERR_xbox_604
source: Cannot delete "{name}" ({path})
cs: Nelze vymazat soubor "{name}" ({path})

# ERR_xbox_605
source: Cannot copy file {path} to {destination}.
cs: Nelze zkopírovat soubor {path} do {destination}.

# ERR_xbox_606
source: Cannot move file {path} to {destination}.
cs: Nelze přemístit soubor {path} do {destination}.

# ERR_xbox_607
source: Cannot create file {path}.
cs: Nelze vytvořit soubor {path}.

# ERR_xbox_608
source: Cannot get attributes on file {path}.
cs: Nelze získat vlastnosti souboru {path}.

# ERR_xbox_609
source: Cannot set attributes on file {path}.
cs: Nelze nastavit vlastnosti souboru {path}.

# ERR_xbox_610
source: Cannot create alias on file {path}.
cs: Nelze vytvořit zástupce souboru {path}.

# ERR_xbox_611
source: Cannot resolve alias file {path}.
cs: Nelze rozlišit zástupce souboru {path}.

# ERR_xbox_612
source: Cannot reveal file {path}.
cs: Nelze odhalit soubor {path}.

# ERR_xbox_613
source: Invalid file kind for file {path}.
cs: Neprávný typ souboru pro soubor {path}.

# ERR_xbox_614
source: "{newname}" is an invalid name for file {path}.
cs: "{newname}" je neplatný název pro soubor {path}.

# ERR_xbox_616
source: File {path} already exists.
cs: Soubor {path} již existuje

# ERR_xbox_617
source: Cannot resolve alias file "{path}" to a file.
cs: Nelze použít zástupce "{path}" na soubor.

# ERR_xbox_618
source: Cannot resolve alias file "{path}" to a folder.
cs: Nelze použít zástuce "{path}" na složku.

# ERR_xbox_650
source: Folder "{name}" not found ({path}).
cs: Složka "{name}" nenalezena ({path}).

# ERR_xbox_651
source: Folder {path} not empty.
cs: Složka {path} není prázdná.

# ERR_xbox_652
source: Cannot create folder {path}.
cs: Nelze vytvořit složku {path}.

# ERR_xbox_653
source: Cannot delete folder {path}.
cs: Složku {path} nelze vymazat.

# ERR_xbox_654
source: Cannot get attributes on folder {path}.
cs: Nelze získat vlastnosti složky {path}.

# ERR_xbox_655
source: Cannot set attributes on folder {path}.
cs: Nelze nastavit vlastnosti složky {path}.

# ERR_xbox_656
source: Cannot reveal folder {path}.
cs: Nelze odhalit složku {path}.

# ERR_xbox_657
source: Cannot rename folder "{name}" to "{newname}" ({path})
cs: Nelze přezvat složku "{name}" na "{newname}" ({path})

# ERR_xbox_658
source: Disk full ({path})
cs: Zaplněný disk ({path})

# ERR_xbox_659
source: Folder {path} already exists.
cs: Složka {path} již existuje.

# ERR_xbox_660
source: Can't copy {path} into child folder {destination}.
cs: Nelze kopírovat {path} do vložené složky {destination}.

# ERR_xbox_661
source: Can't move {path} into trash.
cs: Nelze přemístit {path} do koše.

# ERR_xbox_680
source: Path to file system is not correctly encoded.
cs: Cesta k systému souborů není korektně kódována.

# ERR_xbox_681
source: Operation is not authorized on this file system.
cs: Operace není autorizována pro tento systém souborů.

# ERR_xbox_682
source: File or folder not found.
cs: Soubor nebo složka nenalezeny.

# ERR_xbox_683
source: File system is not in valid state.
cs: Systém souborů není v platném stavu.

# ERR_xbox_684
source: Attempting to write or modify a non-writable file system.
cs: Pokus psát nebo modifikovat do systému souborů jen pro čtení.

# ERR_xbox_685
source: File system is full.
cs: Systém souborů je plný.

# ERR_xbox_686
source: Invalid name '{name}' for a file system.
cs: Neplatný název '{name}' pro systém souborů.

# ERR_xbox_687
source: Can't load file system definition file {path}.
cs: Nelze zavést soubor definic systému souborů {path}.

# ERR_xbox_900
source: JSON cannot stringify cyclic structures.
cs: JSON nemůže provést stringify pro cyklickou strukturu.

# ERR_xmlc_1
source: {systemID}, line:{line}, column:{column}
cs: {systemID}, řádek:{line}, sloupec:{column}
